{
  "architectures": [
    "LaneformerTPForCausalLM"
  ],
  "attn_mask_type": "block_causal",
  "auto_map": {
    "AutoConfig": "configuration_laneformer.LaneformerTPConfig",
    "AutoModelForCausalLM": "modeling_laneformer.LaneformerTPForCausalLM"
  },
  "broadcast_delay": 7,
  "depth_init": true,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_size": 2048,
  "intermediate_size": 8192,
  "lm_head_type": "vocab_parallel",
  "max_position_embeddings": 4096,
  "model_type": "laneformer_tp",
  "multiple_of": 32,
  "norm_eps": 1e-05,
  "num_attention_heads": 32,
  "num_hidden_layers": 31,
  "num_key_value_heads": 8,
  "num_lanes": 8,
  "pre_norm_lane_agg": false,
  "replicated_rmsn_scale": true,
  "rope_theta": 10000,
  "sliding_window": 1547,
  "sliding_window_n_layers": 31,
  "tie_word_embeddings": false,
  "transformers_version": "4.57.3",
  "use_cache": true,
  "use_comm": true,
  "use_early_comm": false,
  "use_flex_attn": true,
  "vocab_size": 32000
}
